Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDma_bf.h
/** \brief  Offset for Ifx_DMA_ACCEN30_Bits.EN21 */
#define IFX_DMA_ACCEN30_EN21_OFF (21u)

/** \brief  Length for Ifx_DMA_ACCEN30_Bits.EN22 */
#define IFX_DMA_ACCEN30_EN22_LEN (1u)

/** \brief  Mask for Ifx_DMA_ACCEN30_Bits.EN22 */
#define IFX_DMA_ACCEN30_EN22_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_ACCEN30_Bits.EN22 */
#define IFX_DMA_ACCEN30_EN22_OFF (22u)

/** \brief  Length for Ifx_DMA_ACCEN30_Bits.EN23 */
#define IFX_DMA_ACCEN30_EN23_LEN (1u)

/** \brief  Mask for Ifx_DMA_ACCEN30_Bits.EN23 */
#define IFX_DMA_ACCEN30_EN23_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_ACCEN30_Bits.EN23 */
#define IFX_DMA_ACCEN30_EN23_OFF (23u)

/** \brief  Length for Ifx_DMA_ACCEN30_Bits.EN24 */
#define IFX_DMA_ACCEN30_EN24_LEN (1u)

/** \brief  Mask for Ifx_DMA_ACCEN30_Bits.EN24 */
#define IFX_DMA_ACCEN30_EN24_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_ACCEN30_Bits.EN24 */
#define IFX_DMA_ACCEN30_EN24_OFF (24u)

/** \brief  Length for Ifx_DMA_ACCEN30_Bits.EN25 */
#define IFX_DMA_ACCEN30_EN25_LEN (1u)

/** \brief  Mask for Ifx_DMA_ACCEN30_Bits.EN25 */
#define IFX_DMA_ACCEN30_EN25_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_ACCEN30_Bits.EN25 */
#define IFX_DMA_ACCEN30_EN25_OFF (25u)

/** \brief  Length for Ifx_DMA_ACCEN30_Bits.EN26 */
#define IFX_DMA_ACCEN30_EN26_LEN (1u)

/** \brief  Mask for Ifx_DMA_ACCEN30_Bits.EN26 */
#define IFX_DMA_ACCEN30_EN26_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_ACCEN30_Bits.EN26 */
#define IFX_DMA_ACCEN30_EN26_OFF (26u)

/** \brief  Length for Ifx_DMA_ACCEN30_Bits.EN27 */
#define IFX_DMA_ACCEN30_EN27_LEN (1u)

/** \brief  Mask for Ifx_DMA_ACCEN30_Bits.EN27 */
#define IFX_DMA_ACCEN30_EN27_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_ACCEN30_Bits.EN27 */
#define IFX_DMA_ACCEN30_EN27_OFF (27u)

/** \brief  Length for Ifx_DMA_ACCEN30_Bits.EN28 */
#define IFX_DMA_ACCEN30_EN28_LEN (1u)

/** \brief  Mask for Ifx_DMA_ACCEN30_Bits.EN28 */
#define IFX_DMA_ACCEN30_EN28_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_ACCEN30_Bits.EN28 */
#define IFX_DMA_ACCEN30_EN28_OFF (28u)

/** \brief  Length for Ifx_DMA_ACCEN30_Bits.EN29 */
#define IFX_DMA_ACCEN30_EN29_LEN (1u)

/** \brief  Mask for Ifx_DMA_ACCEN30_Bits.EN29 */
#define IFX_DMA_ACCEN30_EN29_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_ACCEN30_Bits.EN29 */
#define IFX_DMA_ACCEN30_EN29_OFF (29u)

/** \brief  Length for Ifx_DMA_ACCEN30_Bits.EN2 */
#define IFX_DMA_ACCEN30_EN2_LEN (1u)

/** \brief  Mask for Ifx_DMA_ACCEN30_Bits.EN2 */
#define IFX_DMA_ACCEN30_EN2_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_ACCEN30_Bits.EN2 */
#define IFX_DMA_ACCEN30_EN2_OFF (2u)

/** \brief  Length for Ifx_DMA_ACCEN30_Bits.EN30 */
#define IFX_DMA_ACCEN30_EN30_LEN (1u)

/** \brief  Mask for Ifx_DMA_ACCEN30_Bits.EN30 */
#define IFX_DMA_ACCEN30_EN30_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_ACCEN30_Bits.EN30 */
#define IFX_DMA_ACCEN30_EN30_OFF (30u)

/** \brief  Length for Ifx_DMA_ACCEN30_Bits.EN31 */
#define IFX_DMA_ACCEN30_EN31_LEN (1u)

/** \brief  Mask for Ifx_DMA_ACCEN30_Bits.EN31 */
#define IFX_DMA_ACCEN30_EN31_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_ACCEN30_Bits.EN31 */
#define IFX_DMA_ACCEN30_EN31_OFF (31u)

/** \brief  Length for Ifx_DMA_ACCEN30_Bits.EN3 */
#define IFX_DMA_ACCEN30_EN3_LEN (1u)

/** \brief  Mask for Ifx_DMA_ACCEN30_Bits.EN3 */
#define IFX_DMA_ACCEN30_EN3_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_ACCEN30_Bits.EN3 */
#define IFX_DMA_ACCEN30_EN3_OFF (3u)

/** \brief  Length for Ifx_DMA_ACCEN30_Bits.EN4 */
#define IFX_DMA_ACCEN30_EN4_LEN (1u)

/** \brief  Mask for Ifx_DMA_ACCEN30_Bits.EN4 */
#define IFX_DMA_ACCEN30_EN4_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_ACCEN30_Bits.EN4 */
#define IFX_DMA_ACCEN30_EN4_OFF (4u)

/** \brief  Length for Ifx_DMA_ACCEN30_Bits.EN5 */
#define IFX_DMA_ACCEN30_EN5_LEN (1u)

/** \brief  Mask for Ifx_DMA_ACCEN30_Bits.EN5 */
#define IFX_DMA_ACCEN30_EN5_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_ACCEN30_Bits.EN5 */
#define IFX_DMA_ACCEN30_EN5_OFF (5u)

/** \brief  Length for Ifx_DMA_ACCEN30_Bits.EN6 */
#define IFX_DMA_ACCEN30_EN6_LEN (1u)

/** \brief  Mask for Ifx_DMA_ACCEN30_Bits.EN6 */
#define IFX_DMA_ACCEN30_EN6_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_ACCEN30_Bits.EN6 */
#define IFX_DMA_ACCEN30_EN6_OFF (6u)

/** \brief  Length for Ifx_DMA_ACCEN30_Bits.EN7 */
#define IFX_DMA_ACCEN30_EN7_LEN (1u)

/** \brief  Mask for Ifx_DMA_ACCEN30_Bits.EN7 */
#define IFX_DMA_ACCEN30_EN7_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_ACCEN30_Bits.EN7 */
#define IFX_DMA_ACCEN30_EN7_OFF (7u)

/** \brief  Length for Ifx_DMA_ACCEN30_Bits.EN8 */
#define IFX_DMA_ACCEN30_EN8_LEN (1u)

/** \brief  Mask for Ifx_DMA_ACCEN30_Bits.EN8 */
#define IFX_DMA_ACCEN30_EN8_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_ACCEN30_Bits.EN8 */
#define IFX_DMA_ACCEN30_EN8_OFF (8u)

/** \brief  Length for Ifx_DMA_ACCEN30_Bits.EN9 */
#define IFX_DMA_ACCEN30_EN9_LEN (1u)

/** \brief  Mask for Ifx_DMA_ACCEN30_Bits.EN9 */
#define IFX_DMA_ACCEN30_EN9_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_ACCEN30_Bits.EN9 */
#define IFX_DMA_ACCEN30_EN9_OFF (9u)

/** \brief  Length for Ifx_DMA_BLK_CLRE_Bits.CDER */
#define IFX_DMA_BLK_CLRE_CDER_LEN (1u)

/** \brief  Mask for Ifx_DMA_BLK_CLRE_Bits.CDER */
#define IFX_DMA_BLK_CLRE_CDER_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_BLK_CLRE_Bits.CDER */
#define IFX_DMA_BLK_CLRE_CDER_OFF (17u)

/** \brief  Length for Ifx_DMA_BLK_CLRE_Bits.CDLLER */
#define IFX_DMA_BLK_CLRE_CDLLER_LEN (1u)

/** \brief  Mask for Ifx_DMA_BLK_CLRE_Bits.CDLLER */
#define IFX_DMA_BLK_CLRE_CDLLER_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_BLK_CLRE_Bits.CDLLER */
#define IFX_DMA_BLK_CLRE_CDLLER_OFF (26u)

/** \brief  Length for Ifx_DMA_BLK_CLRE_Bits.CRAMER */
#define IFX_DMA_BLK_CLRE_CRAMER_LEN (1u)

/** \brief  Mask for Ifx_DMA_BLK_CLRE_Bits.CRAMER */
#define IFX_DMA_BLK_CLRE_CRAMER_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_BLK_CLRE_Bits.CRAMER */
#define IFX_DMA_BLK_CLRE_CRAMER_OFF (24u)

/** \brief  Length for Ifx_DMA_BLK_CLRE_Bits.CSER */
#define IFX_DMA_BLK_CLRE_CSER_LEN (1u)

/** \brief  Mask for Ifx_DMA_BLK_CLRE_Bits.CSER */
#define IFX_DMA_BLK_CLRE_CSER_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_BLK_CLRE_Bits.CSER */
#define IFX_DMA_BLK_CLRE_CSER_OFF (16u)

/** \brief  Length for Ifx_DMA_BLK_CLRE_Bits.CSLLER */
#define IFX_DMA_BLK_CLRE_CSLLER_LEN (1u)

/** \brief  Mask for Ifx_DMA_BLK_CLRE_Bits.CSLLER */
#define IFX_DMA_BLK_CLRE_CSLLER_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_BLK_CLRE_Bits.CSLLER */
#define IFX_DMA_BLK_CLRE_CSLLER_OFF (25u)

/** \brief  Length for Ifx_DMA_BLK_CLRE_Bits.CSPBER */
#define IFX_DMA_BLK_CLRE_CSPBER_LEN (1u)

/** \brief  Mask for Ifx_DMA_BLK_CLRE_Bits.CSPBER */
#define IFX_DMA_BLK_CLRE_CSPBER_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_BLK_CLRE_Bits.CSPBER */
#define IFX_DMA_BLK_CLRE_CSPBER_OFF (20u)

/** \brief  Length for Ifx_DMA_BLK_CLRE_Bits.CSRIER */
#define IFX_DMA_BLK_CLRE_CSRIER_LEN (1u)

/** \brief  Mask for Ifx_DMA_BLK_CLRE_Bits.CSRIER */
#define IFX_DMA_BLK_CLRE_CSRIER_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_BLK_CLRE_Bits.CSRIER */
#define IFX_DMA_BLK_CLRE_CSRIER_OFF (21u)

/** \brief  Length for Ifx_DMA_BLK_EER_Bits.EDER */
#define IFX_DMA_BLK_EER_EDER_LEN (1u)

/** \brief  Mask for Ifx_DMA_BLK_EER_Bits.EDER */
#define IFX_DMA_BLK_EER_EDER_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_BLK_EER_Bits.EDER */
#define IFX_DMA_BLK_EER_EDER_OFF (17u)

/** \brief  Length for Ifx_DMA_BLK_EER_Bits.ELER */
#define IFX_DMA_BLK_EER_ELER_LEN (1u)

/** \brief  Mask for Ifx_DMA_BLK_EER_Bits.ELER */
#define IFX_DMA_BLK_EER_ELER_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_BLK_EER_Bits.ELER */
#define IFX_DMA_BLK_EER_ELER_OFF (26u)

/** \brief  Length for Ifx_DMA_BLK_EER_Bits.ERER */
#define IFX_DMA_BLK_EER_ERER_LEN (1u)

